docs/my-todo-workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-23 Wed 19:10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Attempt of a Potentially New TODO Workflow: How to sync Mobile Phone with My Computer.</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">My Attempt of a Potentially New TODO Workflow: How to sync Mobile Phone with My Computer.</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4020077">1. Configuration of My Phone</a>
<ul>
<li><a href="#org669a679">1.1. Configuration of termux</a>
<ul>
<li><a href="#orgdbf75c7">1.1.1. Basic <code>git</code> configuration in termux:</a></li>
<li><a href="#orgf86b5e0">1.1.2. Config My TODOs</a></li>
<li><a href="#org450355c">1.1.3. Config Cron in the Termux</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>Basic idea:</b> I use my computer for most of the TODO plans, but make sure this
changes can be obtained and edited by my phone. Besides, I need to ensure
such a communication is free and has no extra requirements of OS, and so on.
</p>

<p>
<b>Solution:</b> I use <code>termux</code> to manage my doc communication from my phone to the computer,
and use <code>git</code> and corresponding hubs to play the role of "bridge".
</p>

<div id="outline-container-org4020077" class="outline-2">
<h2 id="org4020077"><span class="section-number-2">1.</span> Configuration of My Phone</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org669a679" class="outline-3">
<h3 id="org669a679"><span class="section-number-3">1.1.</span> Configuration of termux</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgdbf75c7" class="outline-4">
<h4 id="orgdbf75c7"><span class="section-number-4">1.1.1.</span> Basic <code>git</code> configuration in termux:</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-sh">pkg update -y &amp;&amp; pkg upgrade -y
pkg install termux-api

pkg install git cronie openssh -y

crond

git config --global user.name <span style="color: #ffe9aa;">"liangzid"</span>
git config --global user.email <span style="color: #ffe9aa;">"2273067585@qq.com"</span>

ssh-keygen -t ed25519 -C <span style="color: #ffe9aa;">"GitHub Key"</span>
<span style="color: #c991e1;">echo</span> <span style="color: #ffe9aa;">"--------------------------Key----------------------------------"</span>
cat ~/.ssh/id_ed25519.pub
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf86b5e0" class="outline-4">
<h4 id="orgf86b5e0"><span class="section-number-4">1.1.2.</span> Config My TODOs</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Download it:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone git@github.com:liangzid/orgtodo.git ~/orgtodo
<span style="color: #c991e1;">cd</span> ~/orgtodo
</pre>
</div>

<p>
Configuration the automatic shell script (<code>~/sync_orgtodo.sh</code>):
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #565575;">#</span><span style="color: #96a0aa;">!/bin/</span><span style="color: #ff8080;">bash</span>

<span style="color: #c991e1;">cd</span> ~/orgtodo || <span style="color: #ff8080;">exit</span> 1

git add -A

<span style="color: #ff8080;">if</span> git diff-index --quiet HEAD --; <span style="color: #ff8080;">then</span>
    <span style="color: #c991e1;">echo</span> <span style="color: #ffe9aa;">"No Changes. Do not require to Upload."</span>
<span style="color: #ff8080;">else</span>
    git commit -m <span style="color: #ffe9aa;">"AutoCommit By TERMUX: $(date +'%Y-%m-%d %H:%M:%S')"</span>
<span style="color: #ff8080;">fi</span>

git pull --no-rebase || <span style="color: #c66; font-weight: bold;">{</span>
    <span style="color: #565575;"># </span><span style="color: #96a0aa;">4. if pull conflict found&#65292;prefer the local version</span>
    <span style="color: #c991e1;">echo</span> <span style="color: #ffe9aa;">"Conflict Found. We use the local version."</span>
    git checkout --ours .   
    git add -A             
    git commit -m <span style="color: #ffe9aa;">"AutoMerge: Keep the mobile version. $(date +'%Y-%m-%d %H:%M:%S')"</span>
<span style="color: #c66; font-weight: bold;">}</span>

git push origin master

<span style="color: #c991e1;">echo</span> <span style="color: #ffe9aa;">"[$(date)] Git sync executed."</span> &gt;&gt; ~/cron.log
termux-notification --title <span style="color: #ffe9aa;">"OrgTODO Sync"</span> --content <span style="color: #ffe9aa;">"All Sync Done :)"</span> --icon <span style="color: #ffe9aa;">"check_circle"</span>
</pre>
</div>

<p>
Change mod:
</p>

<div class="org-src-container">
<pre class="src src-sh">chmod +x ~/sync_orgtodo.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-org450355c" class="outline-4">
<h4 id="org450355c"><span class="section-number-4">1.1.3.</span> Config Cron in the Termux</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<code>crontab -e</code>
</p>

<p>
add the following line:
</p>

<pre class="example">
*/60 * * * * /data/data/com.termux/files/home/sync_orgtodo.sh
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Wed Apr 23 17:01:29 2025</span> <span class="date">Last modified: 2025-04-23 Wed 17:25</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.28)</span> </div>
</div>
</body>
</html>
